## dev: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 35 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `aws_cloudformation_stack.sms-usage-notifications`          |
|        | `aws_iam_policy.quicksight-rds`                             |
|        | `aws_iam_policy.quicksight-s3-usage`                        |
|        | `aws_iam_policy.quicksight_vpc_connection_ec2`              |
|        | `aws_iam_policy.quicksight_vpc_connection_iam`              |
|        | `aws_iam_role.quicksight`                                   |
|        | `aws_iam_role_policy_attachment.ec2-qs-attach`              |
|        | `aws_iam_role_policy_attachment.iam-qs-attach`              |
|        | `aws_iam_role_policy_attachment.rds-qs-attach`              |
|        | `aws_iam_role_policy_attachment.s3-qs-attach`               |
|        | `aws_quicksight_data_set.jobs`                              |
|        | `aws_quicksight_data_set.login_events`                      |
|        | `aws_quicksight_data_set.notifications`                     |
|        | `aws_quicksight_data_set.organisation`                      |
|        | `aws_quicksight_data_set.services`                          |
|        | `aws_quicksight_data_set.sms_usage`                         |
|        | `aws_quicksight_data_set.template-category-history`         |
|        | `aws_quicksight_data_set.templates`                         |
|        | `aws_quicksight_data_set.users`                             |
|        | `aws_quicksight_data_source.rds`                            |
|        | `aws_quicksight_data_source.s3_sms_usage`                   |
|        | `aws_quicksight_group.dataset_owner`                        |
|        | `aws_quicksight_group.dataset_viewer`                       |
|        | `aws_quicksight_refresh_schedule.jobs`                      |
|        | `aws_quicksight_refresh_schedule.login_events`              |
|        | `aws_quicksight_refresh_schedule.notifications`             |
|        | `aws_quicksight_refresh_schedule.organisation`              |
|        | `aws_quicksight_refresh_schedule.services`                  |
|        | `aws_quicksight_refresh_schedule.sms-usage-notifications`   |
|        | `aws_quicksight_refresh_schedule.sms_usage`                 |
|        | `aws_quicksight_refresh_schedule.template-category-history` |
|        | `aws_quicksight_refresh_schedule.templates`                 |
|        | `aws_quicksight_refresh_schedule.users`                     |
|        | `aws_quicksight_vpc_connection.rds`                         |
|        | `aws_s3_object.manifest_file`                               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/11072070270).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudformation_stack.sms-usage-notifications will be created
  + resource "aws_cloudformation_stack" "sms-usage-notifications" {
      + id                = (known after apply)
      + name              = "sms-usage-notifications"
      + notification_arns = (sensitive value)
      + outputs           = (known after apply)
      + parameters        = (known after apply)
      + policy_body       = (known after apply)
      + tags_all          = (known after apply)
      + template_body     = (sensitive value)

      + timeouts {
          + create = "2h"
          + delete = "20m"
          + update = "2h"
        }
    }

  # aws_iam_policy.quicksight-rds will be created
  + resource "aws_iam_policy" "quicksight-rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow access to RDS"
      + id               = (known after apply)
      + name             = "rds-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:Describe*",
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.quicksight-s3-usage will be created
  + resource "aws_iam_policy" "quicksight-s3-usage" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow access to S3"
      + id               = (known after apply)
      + name             = "s3-usage"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "s3:ListBucketMultipartUploads",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.quicksight_vpc_connection_ec2 will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_ec2" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "EC2 permissions for the Quicksight VPC connection"
      + id               = (known after apply)
      + name             = "quicksight-vpc-connection-ec2"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.quicksight_vpc_connection_iam will be created
  + resource "aws_iam_policy" "quicksight_vpc_connection_iam" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM permissions for the Quicksight VPC connection"
      + id               = (known after apply)
      + name             = "quicksight-vpc-connection-iam"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (sensitive value)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.quicksight will be created
  + resource "aws_iam_role" "quicksight" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "quicksight"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ec2-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "ec2-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform-20240823195302049000000001"
    }

  # aws_iam_role_policy_attachment.iam-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "iam-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform-20240823195302049000000001"
    }

  # aws_iam_role_policy_attachment.rds-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "rds-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_iam_role_policy_attachment.s3-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "s3-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_quicksight_data_set.jobs will be created
  + resource "aws_quicksight_data_set" "jobs" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "jobs"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Jobs"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "jobs"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "jobs"
                # (2 unchanged attributes hidden)

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_count"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_delivered"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_failed"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_sent"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "processing_finished"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "processing_started"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "scheduled_for"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }

          + s3_source (known after apply)
        }
    }

  # aws_quicksight_data_set.login_events will be created
  + resource "aws_quicksight_data_set" "login_events" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "login-events"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Login Events"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "login-events"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "login_events"
                # (2 unchanged attributes hidden)

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "user_id"
                  + type = "STRING"
                }
            }

          + s3_source (known after apply)
        }
    }

  # aws_quicksight_data_set.notifications will be created
  + resource "aws_quicksight_data_set" "notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notifications"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "notifications"

          + custom_sql {
              + data_source_arn = (known after apply)
              + name            = "notifications"
              + sql_query       = <<-EOT
                    with notification_data as (
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notifications
                              union
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notification_history
                            ),
                            service_data as (
                              select
                                s.id as service_id,
                                s.active as service_active,
                                count_as_live as service_count_as_live,
                                s.go_live_at as service_go_live_at,
                                s.name as service_name,
                                s.message_limit as service_message_limit,
                                s.rate_limit as service_rate_limit,
                                s.sms_daily_limit as service_sms_daily_limit,
                                o.name as organisation_name,
                                s.organisation_id
                              from services s join organisation o on s.organisation_id = o.id
                            ),
                            template_data as (
                              select
                                t.id as template_id,
                                t.created_at as template_created_at,
                                t.name as template_name,
                                t.updated_at as template_updated_at,
                                t.version as template_version,
                                tc.id as tc_id, 
                                tc.name_en as tc_name_en, 
                                tc.name_fr as tc_name_fr, 
                                tc.email_process_type as tc_email_process_type, 
                                tc.sms_process_type as tc_sms_process_type, 
                                tc.sms_sending_vehicle as tc_sms_sending_vehicle
                              from templates t
                              left outer join template_categories tc on tc.id = t.template_category_id
                            )
                            select
                              notification_id, notification_created_at, notification_sent_at, notification_status,
                              notification_queue_name, notification_type, notification_updated_at, 
                              notification_reference, job_id, api_key_id, api_key_type,
                              s.*, t.*
                            from notification_data n 
                              join service_data s on n.service_id = s.service_id
                              join template_data t on n.template_id = t.template_id
                EOT

              + columns {
                  + name = "notification_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_sent_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_queue_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_reference"
                  + type = "STRING"
                }
              + columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_active"
                  + type = "BOOLEAN"
                }
              + columns {
                  + name = "service_count_as_live"
                  + type = "BOOLEAN"
                }
              + columns {
                  + name = "service_go_live_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "service_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_message_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_rate_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_sms_daily_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "tc_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "tc_name_en"
                  + type = "STRING"
                }
              + columns {
                  + name = "tc_name_fr"
                  + type = "STRING"
                }
              + columns {
                  + name = "tc_email_process_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "tc_sms_process_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "tc_sms_sending_vehicle"
                  + type = "STRING"
                }
            }

          + s3_source (known after apply)
        }
    }

  # aws_quicksight_data_set.organisation will be created
  + resource "aws_quicksight_data_set" "organisation" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "organisation"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Organisation"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "organisation"

          + relational_table {
              + data_source_arn = (known after apply)
              + name            = "organisation"
                # (2 unchanged attributes hidden)

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "organisation_type"
                  + type = "STRING"
                }
            }

          + s3_source (known after apply)
        }
    }

  # aws_quicksight_data_set.services will be created
  + resource "aws_quicksight_data_set" "services" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "services"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Services"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = (known after apply)
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = (known after apply)
        }

      + physical_table_map {
          + physical_table_map_id = "services"

          + custom_sql {
              + data_source_arn = (known after apply)
              + name            = "services"
              + sql_query       = <<-EOT
                    select s.id, s.created_at, s.updated_at, s.active, count_as_live, 
                                   go_live_at, restricted, s.name, organisation_id, o.name as organisation_name,
                                   message_limit, rate_limit, sms_daily_limit
                              from services s inner join organisation o on s.organisation_id = o.id
                EOT

              + columns {
                  + name = "id"
                  + type = "STRING"
                }
              + columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "restricted"
                  + type = "STRING"
                }
              + columns {
                  + name = "name"
                  + type = "STRING"
                }
              + columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }

          + s3_source (known after apply)
        }
    }

  # aws_quicksight_data_set.sms_usage will be created
  + resource "aws_quicksight_data_set" "sms_usage" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms_usage"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "SmsUsage"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration (known after apply)

      + logical_table_map {
          + alias                = "smsusage"
          + logical_table_map_id = "smsusage"

          + data_transforms {
              +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

39 tests, 19 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
